{
  "number": 21,
  "title": "Merge Two Sorted Lists",
  "difficulty": "easy",
  "description": {
    "en": "You are given the heads of two sorted linked lists list1 and list2. Merge the two lists into one sorted list. The list should be made by splicing together the nodes of the first two lists. Return the head of the merged linked list.",
    "zh-CN": "將兩個升序鏈表合併為一個新的升序鏈表並返回。新鏈表是通過拼接給定的兩個鏈表的所有節點組成的。",
    "zh-TW": "將兩個升序鏈結串列合併為一個新的升序鏈結串列並返回。新鏈結串列是通過拼接給定的兩個鏈結串列的所有節點組成的。",
    "ja": "2 つのソート済みリンクリスト list1 と list2 の先頭が与えられます。2 つのリストを 1 つのソート済みリストにマージします。リストは、最初の 2 つのリストのノードをつなぎ合わせて作成する必要があります。マージされたリンクリストの先頭を返します。",
    "es": "Se te dan las cabezas de dos listas enlazadas ordenadas list1 y list2. Fusiona las dos listas en una lista ordenada. La lista debe hacerse empalmando juntos los nodos de las primeras dos listas. Devuelve la cabeza de la lista enlazada fusionada.",
    "de": "Du erhältst die Köpfe von zwei sortierten verknüpften Listen list1 und list2. Verschmelze die zwei Listen zu einer sortierten Liste. Die Liste sollte durch Zusammenfügen der Knoten der ersten zwei Listen erstellt werden. Gib den Kopf der verschmolzenen verknüpften Liste zurück.",
    "fr": "On vous donne les têtes de deux listes chaînées triées list1 et list2. Fusionnez les deux listes en une seule liste triée. La liste doit être créée en épissant ensemble les nœuds des deux premières listes. Renvoyez la tête de la liste chaînée fusionnée."
  },
  "aplSolution": "MergeTwoLists ← {(⍺,⍵)[⍋⍺,⍵]}",
  "explanation": {
    "en": "APL solution for Merge Two Sorted Lists. Uses grade (⍋/⍒) for sorting - returns indices that would sort the array. Implementation uses APL's array-oriented primitives for concise expression.",
    "zh-CN": "Merge Two Sorted Lists 的 APL 解决方案。使用等级 (⍋/⍒) 排序 - 返回将对数组排序的索引。实现使用 APL 的面向数组原语进行简洁表达。",
    "zh-TW": "Merge Two Sorted Lists 的 APL 解決方案。使用等級 (⍋/⍒) 排序 - 返回將對陣列排序的索引。實現使用 APL 的面向陣列原語進行簡潔表達。",
    "ja": "APL solution for Merge Two Sorted Lists. Uses grade (⍋/⍒) for sorting - returns indices that would sort the array. Implementation uses APL's array-oriented primitives for concise expression.",
    "es": "APL solution for Merge Two Sorted Lists. Uses grade (⍋/⍒) for sorting - returns indices that would sort the array. Implementation uses APL's array-oriented primitives for concise expression.",
    "de": "APL solution for Merge Two Sorted Lists. Uses grade (⍋/⍒) for sorting - returns indices that would sort the array. Implementation uses APL's array-oriented primitives for concise expression.",
    "fr": "APL solution for Merge Two Sorted Lists. Uses grade (⍋/⍒) for sorting - returns indices that would sort the array. Implementation uses APL's array-oriented primitives for concise expression."
  },
  "timeComplexity": "O((n+m)*log(n+m))",
  "spaceComplexity": "O(n+m)",
  "verified": false,
  "testCases": [
    {
      "input": "list1=1 2 4, list2=1 3 4",
      "output": "1 1 2 3 4 4"
    },
    {
      "input": "list1=⍬, list2=0",
      "output": "0"
    },
    {
      "input": "list1=⍬, list2=⍬",
      "output": "⍬"
    }
  ]
}