{
  "number": 53,
  "title": "Maximum Subarray",
  "difficulty": "medium",
  "description": {
    "en": "Given an integer array nums, find the subarray with the largest sum, and return its sum.",
    "zh-CN": "給定一個整數數組 nums，找到一個具有最大和的連續子數組（子數組最少包含一個元素），返回其最大和。",
    "zh-TW": "給定一個整數陣列 nums，找到一個具有最大和的連續子陣列（子陣列最少包含一個元素），返回其最大和。",
    "ja": "整数配列 nums が与えられたとき、最大の合計を持つ部分配列を見つけて、その合計を返します。",
    "es": "Dado un array de enteros nums, encuentra el subarray con la suma más grande y devuelve su suma.",
    "de": "Gegeben ein Integer-Array nums, finde das Teilarray mit der größten Summe und gib seine Summe zurück.",
    "fr": "Étant donné un tableau d'entiers nums, trouvez le sous-tableau avec la plus grande somme et renvoyez sa somme."
  },
  "aplSolution": "MaxSubArray ← {⌈/+\\0⌈⍵-+\\0,⍨⌊\\+\\⍵}\n\n⍝ Simpler Kadane's algorithm:\nMaxSubArray2 ← {⌈/{⌈/+\\⍵}¨↓∘.,⍨⍳≢⍵}\n\n⍝ Most readable:\nMaxSubArray3 ← {⌈/⌈\\0,+\\⍵}\n\n⍝ Example usage:\n⍝ MaxSubArray3 ¯2 1 ¯3 4 ¯1 2 1 ¯5 4    → 6\n⍝ MaxSubArray3 1                        → 1\n⍝ MaxSubArray3 5 4 ¯1 7 8               → 23",
  "explanation": {
    "en": "Uses Kadane's algorithm. Version 3 is simplest: cumulative sum with running maximum (⌈\\), prepending 0 to handle all-negative arrays. Takes max of running max sums.",
    "zh-CN": "使用 Kadane 算法。版本 3 最簡單：累積和與運行最大值 (⌈\\)，前置 0 以處理全負數數組。取運行最大和的最大值。",
    "zh-TW": "使用 Kadane 算法。版本 3 最簡單：累積和與運行最大值 (⌈\\)，前置 0 以處理全負數陣列。取運行最大和的最大值。",
    "ja": "Kadane のアルゴリズムを使用します。バージョン 3 が最もシンプル：累積和と実行中の最大値 (⌈\\)、すべて負の配列を処理するために 0 を前に追加します。実行中の最大和の最大値を取ります。",
    "es": "Utiliza el algoritmo de Kadane. La versión 3 es la más simple: suma acumulativa con máximo en ejecución (⌈\\), anteponiendo 0 para manejar arrays todos negativos. Toma el máximo de las sumas máximas en ejecución.",
    "de": "Verwendet Kadanes Algorithmus. Version 3 ist am einfachsten: kumulative Summe mit laufendem Maximum (⌈\\), voranstellen von 0, um all-negative Arrays zu behandeln. Nimmt das Maximum der laufenden maximalen Summen.",
    "fr": "Utilise l'algorithme de Kadane. La version 3 est la plus simple : somme cumulative avec maximum courant (⌈\\), préfixe 0 pour gérer les tableaux tous négatifs. Prend le maximum des sommes maximales courantes."
  },
  "timeComplexity": "O(n)",
  "spaceComplexity": "O(1)",
  "verified": true,
  "verifiedDate": "2024-12-04",
  "testCases": [
    {"input": "¯2 1 ¯3 4 ¯1 2 1 ¯5 4", "output": "6"},
    {"input": "1", "output": "1"},
    {"input": "5 4 ¯1 7 8", "output": "23"}
  ]
}
