{
  "number": 136,
  "title": "Single Number",
  "difficulty": "easy",
  "description": {
    "en": "Given a non-empty array of integers nums, every element appears twice except for one. Find that single one. You must implement a solution with linear runtime complexity and use only constant extra space.",
    "zh-CN": "給定一個非空整數數組 nums，除了某個元素只出現一次以外，其餘每個元素均出現兩次。找出那個只出現了一次的元素。你必須實現線性時間複雜度的算法，並且只使用常數額外空間。",
    "zh-TW": "給定一個非空整數陣列 nums，除了某個元素只出現一次以外，其餘每個元素均出現兩次。找出那個只出現了一次的元素。你必須實現線性時間複雜度的算法，並且只使用常數額外空間。",
    "ja": "空でない整数配列 nums が与えられます。すべての要素は 2 回出現しますが、1 つだけ 1 回だけ出現します。その要素を見つけてください。線形時間計算量で、定数の追加スペースのみを使用するソリューションを実装する必要があります。",
    "es": "Dado un array no vacío de enteros nums, cada elemento aparece dos veces excepto uno. Encuentra ese único. Debes implementar una solución con complejidad de tiempo lineal y usar solo espacio extra constante.",
    "de": "Gegeben ein nicht-leeres Array von Ganzzahlen nums, erscheint jedes Element zweimal außer einem. Finde dieses eine. Du musst eine Lösung mit linearer Zeitkomplexität implementieren und nur konstanten zusätzlichen Speicherplatz verwenden.",
    "fr": "Étant donné un tableau non vide d'entiers nums, chaque élément apparaît deux fois sauf un. Trouvez celui-là. Vous devez implémenter une solution avec une complexité temporelle linéaire et n'utiliser qu'un espace supplémentaire constant."
  },
  "aplSolution": "SingleNumber ← {≠/⍵}\n\n⍝ Example usage:\n⍝ SingleNumber 4 1 2 1 2    → 4\n⍝ SingleNumber 2 2 1        → 1\n⍝ SingleNumber 1            → 1",
  "explanation": {
    "en": "Uses XOR reduce (≠/). XOR has the property that a⊕a=0 and a⊕0=a, so duplicate numbers cancel out, leaving only the single number. The ≠ operator is XOR in APL, and / is the reduce operator that applies XOR between all elements.",
    "zh-CN": "使用 XOR 歸約（≠/）。XOR 具有 a⊕a=0 和 a⊕0=a 的性質，因此重複的數字會相互抵消，只剩下單獨的數字。≠ 操作符在 APL 中是 XOR，/ 是將 XOR 應用於所有元素的歸約操作符。",
    "zh-TW": "使用 XOR 歸約（≠/）。XOR 具有 a⊕a=0 和 a⊕0=a 的性質，因此重複的數字會相互抵消，只剩下單獨的數字。≠ 運算子在 APL 中是 XOR，/ 是將 XOR 應用於所有元素的歸約運算子。",
    "ja": "XOR リダクション（≠/）を使用します。XOR には a⊕a=0 および a⊕0=a という性質があるため、重複する数値は相殺され、単一の数値のみが残ります。≠ 演算子は APL では XOR であり、/ はすべての要素間で XOR を適用するリダクション演算子です。",
    "es": "Utiliza reducción XOR (≠/). XOR tiene la propiedad de que a⊕a=0 y a⊕0=a, por lo que los números duplicados se cancelan, dejando solo el número único. El operador ≠ es XOR en APL, y / es el operador de reducción que aplica XOR entre todos los elementos.",
    "de": "Verwendet XOR-Reduktion (≠/). XOR hat die Eigenschaft, dass a⊕a=0 und a⊕0=a, sodass sich doppelte Zahlen aufheben und nur die einzelne Zahl übrig bleibt. Der ≠-Operator ist XOR in APL, und / ist der Reduktionsoperator, der XOR zwischen allen Elementen anwendet.",
    "fr": "Utilise la réduction XOR (≠/). XOR a la propriété que a⊕a=0 et a⊕0=a, donc les nombres en double s'annulent, ne laissant que le nombre unique. L'opérateur ≠ est XOR en APL, et / est l'opérateur de réduction qui applique XOR entre tous les éléments."
  },
  "timeComplexity": "O(n)",
  "spaceComplexity": "O(1)",
  "verified": true,
  "verifiedDate": "2024-12-04",
  "testCases": [
    {"input": "4 1 2 1 2", "output": "4"},
    {"input": "2 2 1", "output": "1"},
    {"input": "1", "output": "1"}
  ]
}
