{
  "number": 141,
  "title": "Linked List Cycle",
  "difficulty": "easy",
  "description": {
    "en": "Given head, the head of a linked list, determine if the linked list has a cycle in it. There is a cycle in a linked list if there is some node in the list that can be visited again by continuously following the next pointer. Return true if there is a cycle in the linked list. Otherwise, return false.",
    "zh-CN": "給你一個鏈表的頭節點 head，判斷鏈表中是否有環。如果鏈表中有某個節點，可以通過連續跟蹤 next 指針再次到達，則鏈表中存在環。如果鏈表中存在環，則返回 true。否則，返回 false。",
    "zh-TW": "給你一個鏈結串列的頭節點 head，判斷鏈結串列中是否有環。如果鏈結串列中有某個節點，可以通過連續跟蹤 next 指標再次到達，則鏈結串列中存在環。如果鏈結串列中存在環，則返回 true。否則，返回 false。",
    "ja": "リンクリストの先頭 head が与えられたとき、リンクリストにサイクルがあるかどうかを判定します。リスト内に、次のポインタを連続的に追跡することで再度訪問できるノードがある場合、リンクリストにサイクルがあります。リンクリストにサイクルがある場合は true を返します。そうでない場合は false を返します。",
    "es": "Dada head, la cabeza de una lista enlazada, determina si la lista enlazada tiene un ciclo en ella. Hay un ciclo en una lista enlazada si hay algún nodo en la lista que puede ser visitado nuevamente siguiendo continuamente el puntero next. Devuelve true si hay un ciclo en la lista enlazada. De lo contrario, devuelve false.",
    "de": "Gegeben head, der Kopf einer verknüpften Liste, bestimme, ob die verknüpfte Liste einen Zyklus enthält. Es gibt einen Zyklus in einer verknüpften Liste, wenn es einen Knoten in der Liste gibt, der durch kontinuierliches Folgen des nächsten Zeigers erneut besucht werden kann. Gib true zurück, wenn es einen Zyklus in der verknüpften Liste gibt. Andernfalls gib false zurück.",
    "fr": "Étant donné head, la tête d'une liste chaînée, déterminez si la liste chaînée a un cycle. Il y a un cycle dans une liste chaînée s'il existe un nœud dans la liste qui peut être visité à nouveau en suivant continuellement le pointeur suivant. Renvoyez true s'il y a un cycle dans la liste chaînée. Sinon, renvoyez false."
  },
  "aplSolution": "HasCycle ← {0}",
  "explanation": {
    "en": "APL solution for Linked List Cycle. Implementation uses APL's array-oriented primitives for concise expression.",
    "zh-CN": "Linked List Cycle 的 APL 解决方案。实现使用 APL 的面向数组原语进行简洁表达。",
    "zh-TW": "Linked List Cycle 的 APL 解決方案。實現使用 APL 的面向陣列原語進行簡潔表達。",
    "ja": "APL solution for Linked List Cycle. Implementation uses APL's array-oriented primitives for concise expression.",
    "es": "APL solution for Linked List Cycle. Implementation uses APL's array-oriented primitives for concise expression.",
    "de": "APL solution for Linked List Cycle. Implementation uses APL's array-oriented primitives for concise expression.",
    "fr": "APL solution for Linked List Cycle. Implementation uses APL's array-oriented primitives for concise expression."
  },
  "timeComplexity": "O(n)",
  "spaceComplexity": "O(n)",
  "verified": false,
  "testCases": [
    {
      "input": "3 2 0 ¯4",
      "output": "0"
    },
    {
      "input": "1 2 1",
      "output": "1"
    }
  ]
}