{
  "number": 206,
  "title": "Reverse Linked List",
  "difficulty": "easy",
  "description": {
    "en": "Given the head of a singly linked list, reverse the list, and return the reversed list.",
    "zh-CN": "给你单链表的头节点 head，请你反转链表，并返回反转后的链表。",
    "zh-TW": "給你單鏈結串列的頭節點 head，請你反轉鏈結串列，並返回反轉後的鏈結串列。",
    "ja": "単一リンクリストのヘッドノードが与えられたとき、リストを反転し、反転されたリストを返します。",
    "es": "Dado el nodo head de una lista enlazada individualmente, invierte la lista y devuelve la lista invertida.",
    "de": "Gegeben der Kopfknoten einer einfach verketteten Liste, kehre die Liste um und gib die umgekehrte Liste zurück.",
    "fr": "Étant donné le nœud head d'une liste chaînée simple, inversez la liste et renvoyez la liste inversée."
  },
  "aplSolution": "ReverseList ← {⌽⍵}\n\n⍝ Recursive version\nReverseListRecursive ← {\n    ≢⍵ ≤ 1: ⍵\n    head ← ⊃⍵\n    rest ← ∇ 1↓⍵\n    rest, head\n}\n\n⍝ Example\nlist ← 1 2 3 4 5\nresult ← ReverseList list\n⍝ Result: 5 4 3 2 1",
  "explanation": {
    "en": "⌽ is APL's reverse operator - the simplest possible solution! Just one character to reverse any array. The recursive version demonstrates: reverse rest of list, then append head.",
    "zh-CN": "⌽ 是 APL 的反转操作符 - 最简单的解法！只需一个字符就能反转任何数组。递归版本展示了：反转列表的其余部分，然后附加头部。",
    "zh-TW": "⌽ 是 APL 的反轉運算子 - 最簡單的解法！只需一個字元就能反轉任何陣列。遞迴版本展示了：反轉串列的其餘部分，然後附加頭部。",
    "ja": "⌽ は APL の反転演算子です - 最もシンプルなソリューション！任意の配列を反転するには 1 文字だけです。再帰バージョンは次のことを示しています：リストの残りを反転し、次に先頭を追加します。",
    "es": "⌽ es el operador de inversión de APL - ¡la solución más simple posible! Solo un carácter para invertir cualquier array. La versión recursiva demuestra: invierte el resto de la lista, luego añade la cabeza.",
    "de": "⌽ ist APLs Umkehroperator - die einfachste mögliche Lösung! Nur ein Zeichen, um ein beliebiges Array umzukehren. Die rekursive Version zeigt: Kehre den Rest der Liste um, dann füge den Kopf hinzu.",
    "fr": "⌽ est l'opérateur d'inversion d'APL - la solution la plus simple possible ! Un seul caractère pour inverser n'importe quel tableau. La version récursive démontre : inversez le reste de la liste, puis ajoutez la tête."
  },
  "timeComplexity": "O(n)",
  "spaceComplexity": "O(1)"
}