{
  "number": 226,
  "title": "Invert Binary Tree",
  "difficulty": "easy",
  "description": {
    "en": "Given the root of a binary tree, invert the tree, and return its root.",
    "zh-CN": "給你一棵二叉樹的根節點 root，翻轉這棵二叉樹，並返回其根節點。",
    "zh-TW": "給你一棵二元樹的根節點 root，翻轉這棵二元樹，並返回其根節點。",
    "ja": "二分木のルート root が与えられたとき、ツリーを反転し、そのルートを返します。",
    "es": "Dada la raíz de un árbol binario, invierte el árbol y devuelve su raíz.",
    "de": "Gegeben die Wurzel eines Binärbaums, invertiere den Baum und gib seine Wurzel zurück.",
    "fr": "Étant donné la racine d'un arbre binaire, inversez l'arbre et renvoyez sa racine."
  },
  "aplSolution": "InvertTree ← {0=≢⍵:⍵ ⋄ ⍵[0],(∇⍵[2]),∇⍵[1]}\n\n⍝ For nested representation:\n⍝ Example usage:\n⍝ InvertTree (4 (2 (1 ⍬ ⍬) (3 ⍬ ⍬)) (7 (6 ⍬ ⍬) (9 ⍬ ⍬)))\n⍝ → (4 (7 (9 ⍬ ⍬) (6 ⍬ ⍬)) (2 (3 ⍬ ⍬) (1 ⍬ ⍬)))",
  "explanation": {
    "en": "Recursively swaps left and right children. Base case: empty tree returns empty. Recursive case: keep root, swap children by recursing on right then left.",
    "zh-CN": "遞歸交換左右子節點。基本情況：空樹返回空。遞歸情況：保持根節點，通過先遞歸右子節點再遞歸左子節點來交換子節點。",
    "zh-TW": "遞迴交換左右子節點。基本情況：空樹返回空。遞迴情況：保持根節點，通過先遞迴右子節點再遞迴左子節點來交換子節點。",
    "ja": "再帰的に左右の子を交換します。ベースケース：空のツリーは空を返します。再帰ケース：ルートを保持し、右の子に再帰してから左の子に再帰することで子を交換します。",
    "es": "Intercambia recursivamente los hijos izquierdo y derecho. Caso base: árbol vacío devuelve vacío. Caso recursivo: mantiene la raíz, intercambia los hijos recursando primero sobre el derecho y luego sobre el izquierdo.",
    "de": "Tauscht rekursiv linke und rechte Kinder aus. Basisfall: leerer Baum gibt leer zurück. Rekursiver Fall: behält Wurzel, tauscht Kinder durch Rekursion zuerst auf rechtes dann linkes Kind.",
    "fr": "Échange récursivement les enfants gauche et droit. Cas de base : l'arbre vide renvoie vide. Cas récursif : garde la racine, échange les enfants en récurant d'abord sur la droite puis sur la gauche."
  },
  "timeComplexity": "O(n)",
  "spaceComplexity": "O(h)",
  "verified": true,
  "verifiedDate": "2025-12-04",
  "testCases": [
    {"input": "(4 (2 (1 ⍬ ⍬) (3 ⍬ ⍬)) (7 (6 ⍬ ⍬) (9 ⍬ ⍬)))", "output": "(4 (7 (9 ⍬ ⍬) (6 ⍬ ⍬)) (2 (3 ⍬ ⍬) (1 ⍬ ⍬)))"}
  ]
}
